---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.ConduitSizeSettings
source: html/608a3588-2a5f-a248-bce6-e901d3a78aff.htm
---
# ConduitSizeSettings Members

Inserts a new ConduitSize in to the conduit size settings. The conduit standard name determines the location of the new size in the size table.